eJosh/app/controllers/admin/extensions_controller.rb

  def index
    @extensions = Extension.all
---
SELECT * FROM `extensions`

  def update_plugin
    @extension = Extension.find(params[:id])
---
SELECT * FROM `extensions` WHERE (`extensions`.`id` = 1)