app/controllers/plugins_controller.rb

  def index
    extension = Extension.first;
---
SELECT * FROM `extensions` LIMIT 1